# **Pandas**

|  |
| ------:| 
| **pandas is a fast, powerful, flexible and easy to use**   | 
| **open source data analysis and manipulation tool** |
| **built on top of the Python programming language.**    |

[pandas documentation](https://pandas.pydata.org/docs/index.html)

![](./images/pandas.jpg)

#### Author:  Seth Close

#### 31 DEC 2023

In [156]:
import pandas as pd

### **DataFrames**

| code | description |
| ----- | ----- |
| .DataFrame(`<dict>` | creates a DataFrame from a dictionary |
| .head(`<num_rows>`) | first five rows (and column names) |
| .unique() | no duplicates |
| .read_csv(`<file_name or url>`) | reads a csv file |
| .read_excel(`<file_name or url>`) | reads an xlsx file |
| .to_csv(`<file_name>`) | creates a csv file |
| .iloc[x,y] | value in row x, col y |
| .iloc[x] | values in row x |
| .iloc[x].`<column>` | value in row x, `<column>` |
| df[`[<column>]`] | creates a dataframe of that `<column>` |
| df[`[<column1>, <column2>]`] | creates a dataframe of those `<column>` |
| df[`<column>`] == '`column_value`' | column of bool values |
| df[df[`<column>`] == '`column_value`'] | dataframe where bool is True |

##### **Attributes and Methods**

| att/meth | description |
| ----- | ----- |
| shape | Returns the dimensions (number of rows and columns) of the DataFrame. |
| info() | Provides a summary of the DataFrame, including data types and non-null counts. |
| describe() | Generates summary statistics for numerical columns. |
| head(), tail() | Displays the first or last n rows of the DataFrame. |
| mean(), sum(), min(), max() | Calculate summary statistics for columns. |
| sort_values() | Sort the DataFrame by one or more columns. |
| groupby() | Group data based on specific columns for aggregation. |
| fillna(), drop(), rename() | Handle missing values, drop columns, or rename columns. |
| apply() | Apply a function to each element, row, or column of the DataFrame. |
| set_index(`<column_name>`) | sets this column as the index, replacing the numbers for use with loc? |

In [157]:
# Creating a DataFrame from a dictionary
data = {'Name': ['Alice', 'Bob', 'Charlie', 'David'],
        'Age': [25, 30, 35, 28],
        'City': ['New York', 'San Francisco', 'Los Angeles', 'Chicago']}
df = pd.DataFrame(data)
print(df)

      Name  Age           City
0    Alice   25       New York
1      Bob   30  San Francisco
2  Charlie   35    Los Angeles
3    David   28        Chicago

In [158]:
print(df['Name'])  # Access the 'Name' column

0      Alice
1        Bob
2    Charlie
3      David
Name: Name, dtype: object

In [159]:
print(df.iloc[2])   # Access the third row by position

Name        Charlie
Age              35
City    Los Angeles
Name: 2, dtype: object

In [160]:
print(df.loc[1])    # Access the second row by label

Name              Bob
Age                30
City    San Francisco
Name: 1, dtype: object

In [161]:
# Finding Unique Elements:
unique_dates = df['Age'].unique()
unique_dates

array([25, 30, 35, 28])

In [162]:
# Conditional Filtering:
# You can filter data in a DataFrame based on conditions using inequality operators.
high_above_102 = df[df['Age'] > 25]
high_above_102

      Name  Age           City
1      Bob   30  San Francisco
2  Charlie   35    Los Angeles
3    David   28        Chicago

In [163]:
# Saving DataFrames:
# To save a DataFrame to a CSV file, use the to_csv method and specify the filename with a “.csv” extension.Pandas provides other functions for saving DataFrames in different formats.
df.to_csv('trading_data.csv', index=False)

##### Own Example

In [164]:
df = pd.read_csv("csv/people.csv")

In [165]:
df.head(5)

   Name  Age       Job
0  seth   51  Engineer
1  nora   43    Banker
2  amir   15  Engineer

In [166]:
print(df.iloc[1,1])

43

In [167]:
names = df[['Name']]
print(names)

   Name
0  seth
1  nora
2  amir

In [168]:
print(df.iloc[1])

Name      nora
Age         43
Job     Banker
Name: 1, dtype: object

In [169]:
names_jobs = df[['Name','Job']]
print(names_jobs)

   Name       Job
0  seth  Engineer
1  nora    Banker
2  amir  Engineer

In [170]:
print(names_jobs.iloc[0])

Name        seth
Job     Engineer
Name: 0, dtype: object

In [171]:
print(names_jobs.iloc[0].Job)

Engineer

In [172]:
print(df.iloc[1,1])

43

In [173]:
column = df['Name'].unique()
print(column)
for value in column:
    print(value)

['seth' 'nora' 'amir']
seth
nora
amir

In [174]:
df['Job'] == 'Engineer'

0     True
1    False
2     True
Name: Job, dtype: bool

In [175]:
engineers = df[df['Job'] == 'Engineer']
engineers

   Name  Age       Job
0  seth   51  Engineer
2  amir   15  Engineer

In [176]:
engineers.to_csv('./csv/engineers.csv')

### **Series**

##### **Attributes and Methods**

| att/meth | description |
| ----- | ----- |
| values | Returns the Series data as a NumPy array. |
| index | Returns the index (labels) of the Series. |
| shape | Returns a tuple representing the dimensions of the Series. |
| size | Returns the number of elements in the Series. |
| mean(), sum(), min(), max() | Calculate summary statistics of the data. |
| unique(), nunique() | Get unique values or the number of unique values. |
| sort_values(), sort_index() | Sort the Series by values or index labels. |
| isnull(), notnull() | Check for missing (NaN) or non-missing values. |
| apply() | Apply a custom function to each element of the Series. |

In [177]:
# Create a Series from a list
data = [10, 20, 30, 40, 50]
s = pd.Series(data)
print(s)

0    10
1    20
2    30
3    40
4    50
dtype: int64

In [187]:
print(s[2])     # Access the element with label 2 (value 30)
print()
print(s.iloc[3]) # Access the element at position 3 (value 40)
print()
print(s[1:4])   # Access a range of elements by label

30

40

1    20
2    30
3    40
dtype: int64

In [186]:
for item in s:
    print(item)

10
20
30
40
50

In [190]:
print(s.loc[3])

40

### Pandas Exercise From Class

In [191]:
xlsx_site = 'https://cf-courses-data.s3.us.cloud-object-storage.appdomain.cloud/'
xlsx_path = 'IBMDeveloperSkillsNetwork-PY0101EN-SkillsNetwork/jupyterlite/files/Module%205/data/TopSellingAlbums.xlsx'
df = pd.read_excel(xlsx_site+xlsx_path)
df.head(3)

,Artist,Album,Released,Length,Genre,Music Recording Sales (millions),Claimed Sales (millions),Released.1,Soundtrack,Rating
0,Michael Jackson,Thriller,1982,00:42:19,"pop, rock, R&B",46.0,65,1982-11-30,NaN,10.0
1,AC/DC,Back in Black,1980,00:42:11,hard rock,26.1,50,1980-07-25,NaN,9.5
2,Pink Floyd,The Dark Side of the Moon,1973,00:42:49,progressive rock,24.2,45,1973-03-01,NaN,9.0

In [192]:
# Use a variable q to store the column Rating as a dataframe
q = df[['Rating']]
q

   Rating
0    10.0
1     9.5
2     9.0
3     8.5
4     8.0
5     7.5
6     7.0
7     6.5

In [193]:
# Assign the variable q to the dataframe that is made up of the column Released and Artist:
q = df[['Rating','Artist']]
q

   Rating           Artist
0    10.0  Michael Jackson
1     9.5            AC/DC
2     9.0       Pink Floyd
3     8.5  Whitney Houston
4     8.0        Meat Loaf
5     7.5           Eagles
6     7.0         Bee Gees
7     6.5    Fleetwood Mac

In [194]:
# Access the 2nd row and the 3rd column of df:
df.iloc[1, 2]

1980

In [195]:
# Use the following list to convert the dataframe index df to characters and assign it to df_new; 
# find the element corresponding to the row index a and column 'Artist'. 
# Then select the rows a through d for the column 'Artist'

new_index=['a','b','c','d','e','f','g','h']

df_new=df
df_new.index=new_index
df_new.loc['a':'d', 'Artist']

a    Michael Jackson
b              AC/DC
c         Pink Floyd
d    Whitney Houston
Name: Artist, dtype: object

In [196]:
df_new.index=range(8)